@calculator
Feature: สามารถ + - * / ได้

  Scenario: บวก
    Given ในถังข้อมูล "A" มีเลข "10"
    Given ในถังข้อมูล "B" มีเลข "16"
    When นำเลขใน "ถังข้อมูล A" กับ "ถังข้อมูล B" มาบวกกัน เก็บผลลัพธ์ลง ถังข้อมูล "Result"
    Then "ถังข้อมูล Result" จะต้องมีค่าเท่ากับ "26"

  Scenario: ลบ
    Given ในถังข้อมูล "A" มีเลข "20"
    Given ในถังข้อมูล "B" มีเลข "10"
    When นำเลขใน "ถังข้อมูล A" กับ "ถังข้อมูล B" มาลบกัน เก็บผลลัพธ์ลง ถังข้อมูล "Result"
    Then "ถังข้อมูล Result" จะต้องมีค่าเท่ากับ "10"

  Scenario: คูณ
    Given ในถังข้อมูล "A" มีเลข "5"
    Given ในถังข้อมูล "B" มีเลข "5"
    When นำเลขใน "ถังข้อมูล A" กับ "ถังข้อมูล B" มาคูณกัน เก็บผลลัพธ์ลง ถังข้อมูล "Result"
    Then "ถังข้อมูล Result" จะต้องมีค่าเท่ากับ "25"

  Scenario: หาร
    Given ในถังข้อมูล "A" มีเลข "25"
    Given ในถังข้อมูล "B" มีเลข "5"
    When นำเลขใน "ถังข้อมูล A" กับ "ถังข้อมูล B" มาหารกัน เก็บผลลัพธ์ลง ถังข้อมูล "Result"
    Then "ถังข้อมูล Result" จะต้องมีค่าเท่ากับ "5"
